In [2]:
import pandas as pd
import numpy as np
import random
from IPython.display import display, HTML
import matplotlib.pyplot as plt

studentsData = pd.read_csv('StudentsPerformance.csv')
namesData = pd.read_csv('all_goalkeepers.csv')

studentsData.insert(0,'Name',namesData['Player'])
studentsData.insert(2,'Age',[random.randint(18,28) for i in range(studentsData.shape[0])])
studentsData.insert(3,'StudentID',[10000 + i for i in range(studentsData.shape[0])])
studentsData = studentsData.rename(columns = {"race/ethnicity": "ethnicity", "parental level of education": "parental education"})

studentsData.to_csv('final.csv')

studentsData

,Name,gender,Age,StudentID,ethnicity,parental education,lunch,test preparation course,math score,reading score,writing score
0,Mark Dodd,female,28,10000,group B,bachelor's degree,standard,none,72,72,74
1,Tony Meola,female,26,10001,group C,some college,standard,completed,69,90,88
2,Mark Dougherty,female,25,10002,group B,master's degree,standard,none,90,95,93
3,Jorge Campos,male,20,10003,group A,associate's degree,free/reduced,none,47,57,44
4,Garth Lagerwey,male,25,10004,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...,...,...,...
995,Luis Robles,female,28,10995,group E,master's degree,standard,completed,88,99,95
996,Zack Steffen,male,20,10996,group C,high school,free/reduced,none,62,55,55
997,Bobby Shuttleworth,female,19,10997,group C,high school,free/reduced,completed,59,71,65
998,Stefan Frei,female,22,10998,group D,some college,standard,completed,68,78,77
999,Joe Bendik,female,20,10999,group D,some college,free/reduced,none,77,86,86

General Analysis

In [3]:
def datasetAnalysis(dataset):
    display(HTML('<h4>Analysis by gender</h4'))
    display(dataset.groupby("gender").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by age</h4'))
    display(dataset.groupby("Age").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by ethnicity</h4'))
    display(dataset.groupby("ethnicity").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by parental level of education</h4'))
    display(dataset.groupby("parental education").mean()[["math score","reading score","writing score"]])

    display(HTML('<h4>Analysis by test preparation course</h4'))
    display(dataset.groupby("test preparation course").mean()[["math score","reading score","writing score"]])

In [4]:
datasetAnalysis(pd.read_csv('final.csv'))

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

     math score  reading score  writing score
Age
18    64.012500      67.925000      66.037500
19    64.525773      68.402062      66.896907
20    67.426966      70.595506      69.460674
21    65.381443      68.257732      67.319588
22    68.291139      70.594937      69.544304
23    66.196078      70.009804      69.156863
24    63.852273      67.454545      66.875000
25    65.155340      68.893204      67.776699
26    69.197531      71.123457      70.197531
27    64.360465      65.616279      64.825581
28    68.867347      71.857143      70.357143

           math score  reading score  writing score
ethnicity
group A     61.629213      64.674157      62.674157
group B     63.452632      67.352632      65.600000
group C     64.463950      69.103448      67.827586
group D     67.362595      70.030534      70.145038
group E     73.821429      73.028571      71.407143

                    math score  reading score  writing score
parental education
associate's degree   67.882883      70.927928      69.896396
bachelor's degree    69.389831      73.000000      73.381356
high school          62.137755      64.704082      62.448980
master's degree      69.745763      75.372881      75.677966
some college         67.128319      69.460177      68.840708
some high school     63.497207      66.938547      64.888268

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673